/*** 기본 SQL 문제 ***/

-----------------------------------------------------------------------------------------------------------------------------------

/* 문제 1 */
--정렬은 입사일(hire_date)의 올림차순(ASC)으로 가장 선임부터 출력이 되도록 하세요.
--이름(first_name last_name),  월급(salary),  전화 번호(phone_number), 입사일(hire_date) 순서
--“이름”, “월급”, “전화 번호”, “입사일” 로 컬럼 이름을 대체해 보세요.
select first_name || ' ' || last_name "이름"
          , salary "월급"
          , phone_number "전화 번호"
          , hire_date "입사일"
from employees
order by hire_date asc;

-----------------------------------------------------------------------------------------------------------------------------------

/* 문제 2 */
--업무(jobs)별로 업무 이름(job_title)과 최고 월급(max_salary)을 월급의 내림차순(DESC)로 정렬하세요.
select job_title
          , max_salary
from jobs
order by max_salary desc;

-----------------------------------------------------------------------------------------------------------------------------------

 /* 문제 3 */
--담당 매니저가 배정되어 있으나 커미션 비율이 없고, 월급이 3000초과인 직원의 이름, 매니저 아이디, 커미션 비율, 월급을 출력하세요.
select first_name
          , manager_id
          , commission_pct
          , salary
from employees
where manager_id is not null
and commission_pct is null
and salary > 3000;

-----------------------------------------------------------------------------------------------------------------------------------

 /* 문제 4 */
--최고 월급(max_salary) 10000이상인 업무의 이름(job_title)과 최고 월급(max_salary)을 최고 월급의(max_salary) 내림차순(DESC)로 정렬하여 출력하세요.    
select job_title
          , max_salary
from jobs
where max_salary >= 10000
order by max_salary desc;

-----------------------------------------------------------------------------------------------------------------------------------

 /* 문제 5 */
--월급 14000미만 10000이상인 직원의 이름(first_name), 월급, 커미션 퍼센트를  월급순(내림차순) 출력하세요.
--단, 커미션 퍼센트 가 null 이면 0 으로 나타내시오.
select first_name
         , salary
          , nvl (commission_pct, 0)
from employees
where salary between 10000 and 13999
order by salary desc;

-----------------------------------------------------------------------------------------------------------------------------------

 /* 문제 6 */
--부서 번호가 10, 90, 100인 직원의 이름, 월급, 입사일, 부서 번호를 나타내시오.
--입사일은 1977-12 와 같이 표시하시오.
select first_name
          , salary
          , to_char (hire_date, 'YYYY-MM') hire_date
          , department_id
from employees;

-----------------------------------------------------------------------------------------------------------------------------------

 /* 문제 7 */
--이름(first_name)에 S 또는 s가 들어가는 직원의 이름, 월급을 나타내시오.
select first_name
          , salary
from employees
where first_name like '%s%'
or first_name like 'S%';

-----------------------------------------------------------------------------------------------------------------------------------

/* 문제 8 */
--전체 부서를 출력하려고 합니다. 순서는 부서 이름이 긴 순서대로 출력해 보세오.
select *
from departments
order by length(department_name) desc; 

-----------------------------------------------------------------------------------------------------------------------------------

 /* 문제 9 */
--정확하지 않지만, 지사가 있을 것으로 예상되는 나라들을 나라 이름을 대문자로 출력하고 올림차순(ASC)으로 정렬해 보세요.
select initcap(country_name)
from countries
order by country_name asc;

-----------------------------------------------------------------------------------------------------------------------------------

 /* 문제 10 */
--03/12/31 이전 입사한 직원의 이름, 월급, 전화 번호, 입사일을 출력하세요
--전화번호는 545-343-3433 과 같은 형태로 출력하세요.
select first_name
          , salary
          , replace (phone_number, '.', '-') phone_number
          , hire_date
from employees
where hire_date <= '03/12/31';

-----------------------------------------------------------------------------------------------------------------------------------


